{
  "success": true,
  "data": {
    "description": "TexEcon.com",
    "id": 1,
    "menu": [
      {
        "action": "index",
        "api_url": null,
        "argument": "arizona",
        "controller": "Page",
        "description": "From the Grand Canyon to Grand Opportunities: Arizona's Economic Development Story",
        "keywords": " ",
        "display_navigation": true,
        "order": 210,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-right",
        "id": 25,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"arizona\">Arizona</h1>\n<h2 id=\"from-the-grand-canyon-to-grand-opportunities\">From the Grand Canyon to Grand Opportunities</h2>\n<p>Arizona is a state in the southwestern United States with a diverse economy that has been growing steadily in recent years. The state's economic development is driven by a variety of industries, including manufacturing, tourism, healthcare, and technology.</p>\n<p>Manufacturing is a major contributor to Arizona's economy, with industries such as aerospace and defense, electronics, and semiconductors playing a significant role. The state has become a hub for advanced manufacturing, with companies like Intel, Honeywell, and Raytheon having a significant presence in the region.</p>\n<p>Tourism is also a critical sector for Arizona's economy, with attractions such as the Grand Canyon, Sedona, and the Phoenix metropolitan area drawing millions of visitors each year. In addition to traditional tourism, Arizona has also seen significant growth in the hospitality industry, with new hotels and resorts opening throughout the state.</p>\n<p>Arizona's healthcare industry has also experienced significant growth, with several major healthcare providers operating in the state, including Banner Health and Dignity Health. The state is also home to several research institutions and biotech companies, contributing to the growth of the life sciences sector.</p>\n<p>Finally, Arizona is becoming an increasingly important hub for technology, with companies like Intel, Microsoft, and Amazon establishing major operations in the state. The state has also become a hub for startups and entrepreneurship, with organizations like the Arizona Commerce Authority and the Arizona Technology Council supporting the growth of the tech sector.</p>\n<p>Overall, Arizona's economy is diverse and growing, with a focus on advanced manufacturing, tourism, healthcare, and technology. With a supportive business climate and a talented workforce, the state is well positioned for continued economic development in the years to come.</p>\n",
        "parent": "",
        "parent_page": null,
        "parent_title": "",
        "title": "Arizona",
        "url": "/arizona",
        "virtual_path": "index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas/austin",
        "controller": "Page",
        "description": "Austin",
        "keywords": " ",
        "display_navigation": true,
        "order": 150,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 6,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"austin-texas\">Austin, Texas</h1>\n<p><strong>A Thriving City and Economic Hub</strong></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/KzX9kJumv9A\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Austin, the capital city of Texas, is widely recognized as one of the most vibrant and dynamic cities in the country. With its strong economy, highly educated workforce, and thriving cultural scene, Austin is a hub for innovation and growth, and it is an important contributor to the overall strength of the Texas economy.</p>\n<p>At the heart of Austin's economic success is its highly educated and highly skilled workforce. The city is home to several world-class universities, including The University of Texas at Austin, which is one of the largest and most respected public universities in the country. These universities are a major source of talent and innovation, and they play a critical role in the city's economic success.</p>\n<p>Another important aspect of Austin's economy is its thriving technology industry. Austin is home to a large number of high-tech companies, including many of the world's leading technology companies. These companies are attracted to Austin by its highly educated workforce, supportive business climate, and attractive quality of life, and they play a major role in driving the city's economic growth.</p>\n<p>In addition to its universities and high-tech companies, Austin is also the home of many state government offices, including the Texas State Capitol. The state government is an important employer and contributor to the local economy, and it plays a key role in shaping the policies and programs that support economic growth in the state.</p>\n<p>Despite its many strengths, Austin is not immune to challenges and risks. For example, the city's fast-growing population is putting pressure on infrastructure and other public services, and this is a challenge that will need to be addressed in the years to come. Additionally, the city's thriving economy has also led to rising housing prices and a tight housing market, which is a challenge for many residents and businesses.</p>\n<p>Despite these challenges, the outlook for Austin remains positive. With its strong economy, highly educated workforce, and thriving cultural scene, Austin is well positioned to continue its economic growth and to maintain its status as one of the most dynamic and innovative cities in the country.</p>\n<p>At TexEcon.com, our mission is to provide insightful analysis and commentary on the Austin economy. We believe that by providing expert analysis and commentary, we can help our audience understand the strengths, challenges, and future prospects of this vibrant and dynamic city. Join us as we explore the economic landscape of Austin, Texas.</p>\n",
        "parent": "Page",
        "parent_page": 2,
        "parent_title": "Texas",
        "title": "Austin",
        "url": "/texas/austin",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas/dallas",
        "controller": "Page",
        "description": "Dallas",
        "keywords": " ",
        "display_navigation": true,
        "order": 160,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 7,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"dallas-texas\">Dallas, Texas</h1>\n<p><strong>Thriving Hub of the Southwestern US Economy</strong></p>\n<p>Dallas, Texas, often referred to as the &quot;Big D&quot;, is one of the largest cities in the United States and a major hub of the Southwestern economy. With a population of over 1.3 million people and an metropolitan area of over 7 million, Dallas has a robust and diverse economy that covers a wide range of industries, including finance, technology, retail, transportation, and healthcare.</p>\n<h2 id=\"finance-and-business-services\">Finance and Business Services</h2>\n<p>Dallas is home to a number of major financial institutions, including JPMorgan Chase, Wells Fargo, and Bank of America, as well as several smaller banks and investment firms. The city's central location and strong transportation infrastructure make it an attractive location for business services companies, including accounting and consulting firms, legal services, and data processing companies.</p>\n<h2 id=\"technology-and-innovation\">Technology and Innovation</h2>\n<p>Dallas is also a center of innovation and technology, with a thriving start-up scene and a large presence of tech companies such as AT&amp;T, Verizon, and Texas Instruments. The city is also home to a number of research institutions, including the University of Texas at Dallas, which conducts cutting-edge research in fields such as robotics, artificial intelligence, and nanotechnology.</p>\n<h2 id=\"retail-and-tourism\">Retail and Tourism</h2>\n<p>Retail is another major contributor to the Dallas economy, with several large shopping centers, including the Galleria Dallas, the NorthPark Center, and the West Village. The city is also a popular tourist destination, with attractions such as the AT&amp;T Stadium, home of the Dallas Cowboys, the Sixth Floor Museum at Dealey Plaza, and the Dallas Arboretum and Botanical Garden.</p>\n<h2 id=\"transportation-and-logistics\">Transportation and Logistics</h2>\n<p>Dallas is a major transportation hub, with two airports, two major highways, and a large network of railroads. The city is also a key hub for the oil and gas industry, with several major refining and production facilities located in the metropolitan area.</p>\n<h2 id=\"healthcare\">Healthcare</h2>\n<p>Dallas has a large and growing healthcare industry, with several major hospitals, including Parkland Memorial Hospital and UT Southwestern Medical Center, and a thriving biotechnology sector. The city is also home to several major pharmaceutical companies, including Merck and Pfizer, as well as numerous research and development organizations.</p>\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Dallas, Texas is a thriving city with a strong and diverse economy that covers a wide range of industries. From finance and technology to retail and healthcare, Dallas offers a wealth of opportunities for businesses and individuals alike. With its central location, strong transportation infrastructure, and large pool of highly educated talent, Dallas is well-positioned to continue to be a major player in the Southwestern economy for years to come.</p>\n",
        "parent": "Page",
        "parent_page": 2,
        "parent_title": "Texas",
        "title": "Dallas",
        "url": "/texas/dallas",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas/houston",
        "controller": "Page",
        "description": "Houston",
        "keywords": " ",
        "display_navigation": true,
        "order": 170,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 8,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"houston-texas\">Houston, Texas</h1>\n<p><strong>The Powerhouse of the Lone Star State's Economy</strong></p>\n<p>Houston, the fourth largest city in the United States, is a major player in the Texas economy. With a population of over 2.3 million people and a thriving business community, Houston is one of the country's leading economic centers. The city is home to some of the largest companies in the world, including oil and gas companies, manufacturing firms, and transportation companies, which drive Houston's economic growth.</p>\n<h2 id=\"oil-and-gas-industry\">Oil and Gas Industry</h2>\n<p>Houston is known as the &quot;Energy Capital of the World&quot; due to its dominance in the oil and gas industry. The city is home to numerous energy companies, including ConocoPhillips, ExxonMobil, and Chevron, that extract, refine, and distribute oil and natural gas. The energy sector accounts for a significant portion of Houston's economy and employs tens of thousands of people in the area.</p>\n<h2 id=\"manufacturing-and-logistics\">Manufacturing and Logistics</h2>\n<p>In addition to its thriving energy industry, Houston is also a hub for manufacturing and logistics. The city is home to several large manufacturing companies, including Dow Chemical, BASF, and Kraft Heinz, that produce a variety of goods, from plastics and chemicals to food products. The city's location along the Gulf of Mexico, along with its extensive transportation network, makes it an ideal location for logistics and distribution companies. These companies play a vital role in Houston's economy by connecting the city to global markets and facilitating the movement of goods throughout the region.</p>\n<h2 id=\"healthcare-and-biotechnology\">Healthcare and Biotechnology</h2>\n<p>Houston is also a major player in the healthcare and biotechnology industries. The city is home to the Texas Medical Center, the largest medical complex in the world, which is home to numerous hospitals, research institutions, and medical schools. The healthcare sector employs a significant portion of Houston's workforce and contributes to the city's economy by providing jobs, attracting investment, and fostering innovation.</p>\n<h2 id=\"home-for-diversity\">Home for Diversity</h2>\n<p>Houston, Texas is one of the largest cities in the United States and is considered a cultural and economic hub of the South. With a population of over 2.3 million people, Houston is renowned for its diversity and is often referred to as the &quot;melting pot of cultures.&quot; This cultural diversity is reflected in the city's numerous ethnic neighborhoods, festivals, and restaurants.</p>\n<p>The Houston economy is diverse and thriving, with a strong emphasis on energy, healthcare, and aerospace. Houston is home to over 4,000 energy-related companies, making it a major hub for the oil and gas industry. It is also the headquarters for several of the largest healthcare organizations in the world, including Memorial Hermann Health System, Texas Children's Hospital, and MD Anderson Cancer Center.</p>\n<p>In addition to its strong energy and healthcare sectors, Houston is also a hub for the aerospace industry, with companies such as Boeing and NASA's Johnson Space Center located in the city. Houston is also home to several major ports, including the Port of Houston, which is the second largest port in the United States by tonnage.</p>\n<p>Houston is also home to many universities and colleges, including the University of Houston, Rice University, and Texas Southern University. These institutions contribute to the city's economic growth by providing a well-educated workforce and conducting cutting-edge research.</p>\n<p>Houston is a city that celebrates its cultural diversity through various festivals and events, such as the Houston Livestock Show and Rodeo, the Houston International Festival, and the Houston Greek Festival. These events bring together people from all walks of life to celebrate their unique cultural heritage while reinforcing the spirit of unity that defines Houston.</p>\n<p>In conclusion, Houston is a city that combines a thriving economy with a rich cultural heritage. Its diverse population, strong energy and healthcare sectors, and numerous universities make it a city that is not only thriving but also proud of its cultural roots. Houston is a city where people from all over the world can come together to celebrate their uniqueness while reinforcing what it means to live in this vibrant city.</p>\n",
        "parent": "Page",
        "parent_page": 2,
        "parent_title": "Texas",
        "title": "Houston",
        "url": "/texas/houston",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texecon/jared-hazleton",
        "controller": "Page",
        "description": "American economist, and educator.",
        "keywords": " ",
        "display_navigation": true,
        "order": 120,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-right",
        "id": 4,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"jared-earl-hazleton\">Jared Earl Hazleton</h1>\n<p>American economist, and educator. Recipient, John W. Gardner Award, Rice University, 1965, Red Feather Award, Red Feather Society, 2004; grant, National Science Foundation, 1972-1976, Environmental Protection Agency, 1996-1998. <strong><a href=\"https://www.goodreads.com/author/show/1405162.Jared_E_Hazleton\">author</a></strong></p>\n<p>Dr. Jared Hazleton is a renowned economist with a Ph.D. in Economics from Rice University. He has published numerous articles and books on a wide range of economics topics and is known for his insightful analysis and commentary. He is the lead author at TexEcon.com and is dedicated to educating and informing the public about the Texas economy. Hazleton is a former professor at the University of Texas and the University of Washington and has held various positions in research and academia. He is also the principal of TexEcon and has held positions in various organizations, including the Texas Research League, the Arthritis Foundation, and the United Way Texas. Hazleton has written books on the economics of the sulfur industry, fisheries economics, and macroeconomic policy.</p>\n<p>Dr. Hazleton's expertise in economics is unmatched, and he brings a wealth of knowledge and experience to TexEcon.com. He is dedicated to educating and informing the public about the economy, and to providing insightful analysis and commentary on the current state and future prospects of the Texas economy.</p>\n<p>We are thrilled to have Dr. Hazleton as the lead author at TexEcon.com, and we are confident that his expertise and insights will be an invaluable resource for our audience. Whether you are a seasoned professional or just starting to explore the world of economics, we are sure that you will find Dr. Hazleton's contributions to be informative, insightful, and thought-provoking.</p>\n<p>Join us in welcoming Dr. Jared Hazleton to TexEcon.com, and be sure to check out his contributions to our platform. We are confident that you will find his analysis and commentary to be an essential resource for anyone interested in the Texas economy.</p>\n<h1 id=\"biography\">Biography</h1>\n<blockquote>\n<p>Jared Earl Hazleton was born on September 12, 1937, in Oklahoma City, Oklahoma, United States to Alfred Larson and Myrtle Frances Hazleton.</p>\n</blockquote>\n<h2 id=\"education\">Education</h2>\n<p>Bachelor of Business Administration, University Oklahoma, Norman, 1959.<br />\nDoctor of Philosophy in Economics, Rice University, Houston, 1961.</p>\n<h2 id=\"career-highlights\">Career Highlights</h2>\n<ul>\n<li>Research Economist Federal Reserve Bank Boston, 1964—1965, manager research department, 1965—1966, banking services officer, 1966—1968. Lecturer University Texas, Austin, 1968—1969, professor to associate dean, 1975—1980, associate professor, 1970—1975. Professor to Dean University Washington, Seattle, 1980—1982.</li>\n<li>President Texas Research League, Austin, 1982—1987. Vice president, economics Mesa Ltd Partnership, Amarillo, 1987—1989. Director, economic research center, Professor Texas Advertising &amp; Marketing University, College Station, 1989—1999.</li>\n<li>Principal Texecon, Austin, since 2007</li>\n<li>Professor, finance, dean University North Texas, Denton, 1999—2007</li>\n<li>Lt Supply Corps United States Naval Reserve United States Navy, 1959-1961</li>\n<li>Director Bryan Rotary Club, Texas, 1997—1999.</li>\n<li>President Arthritis Foundation, Austin, 1970—1972.</li>\n<li>Chairman United Way Texas, 1984—1986.</li>\n<li>Member of Southwestern Economics Association (elected president).</li>\n<li>Principal for Economics, TexEcon</li>\n</ul>\n<h2 id=\"published-works\">Published Works</h2>\n<ul>\n<li><p><a href=\"https://www.amazon.com/Economics-Sulphur-Industry-Routledge-Revivals-ebook/dp/B019H24HT6/ref=sr_1_2?s=digital-text&amp;ie=UTF8&amp;qid=1544364184&amp;sr=1-2\">The Economics of the Sulphur Industry</a></p>\n<blockquote>\n<p>Between the 1950s and 1970s, the Sulphur industry continued to grow despite occasional shortages and excesses. In this study originally published in 1970, Hazleton focuses on the Frasch sulfur industry to explore issues such as competing sources of sulfur, the possibilities of sulfur being obtained as a result of pollution-abating policies, and the conditions under which future supplies are likely to become available. This title will be of interest to students of Environmental Studies.&quot;</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.semanticscholar.org/paper/Recent-developments-and-research-in-fisheries-%3A-at-Bell-Hazleton/50a585a5cf80692a3abf857641d52774ea66ff55\">Recent Research and Developments in Fisheries Economics</a></p>\n<blockquote>\n<p>Edited by F.W. Bell and J.E. Hazleton. Published by Oceans Publications, Inc. in 1967, the book consists of papers presented at a symposium on the problems of the New England fisheries, organized by the New England Research Foundation, the Bureau of Commercial Fisheries, and the Federal Reserve Bank of Boston in 1965.\nThe book primarily addresses the economic issues specific to the New England fishery region. The papers in the book provide valuable contributions to the analysis of regional fisheries. These contributions lie in the analytical methods used, the subject areas covered, and their potential implications, rather than definitive findings.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.amazon.com/Managing-Macroeconomic-Policy-Johnson-Presidency-ebook/dp/B00PBCY86Y/ref=sr_1_1?s=digital-text&amp;ie=UTF8&amp;qid=1544364130&amp;sr=1-1\">Managing Macroeconomic Policy: The Johnson Presidency</a></p>\n<blockquote>\n<p>Macroeconomic policy involves government action intended to influence the overall operation of the economy and to deal with such important public problems as economic growth, inflation, unemployment, and recession. In this first comprehensive treatment of presidential management of such policy for any presidency, authors James E. Anderson and Jared E. Hazleton focus on four tasks: developing and maintaining an information and decision-making system; coordination of policies in different macroeconomic areas; building support or consent for presidential policies; and administrative leadership. Drawing extensively upon presidential documents and interviews with Johnson administration officials, the authors pay particular attention to fiscal, monetary, wage-price, and international economic (especially balance of payments) policies during Johnson’s terms. The authors use the concept of the sub-presidency, as defined by Redford and Blisset in Organizing the Executive Branch: The Johnson Presidency (University of Chicago Press, 1981), to show how Johnson managed the macro-economic institutions of the Council of Economic Advisors, the Bureau of the Budget (now the Office of Management and Budget), the Department of the Treasury, and the Federal Reserve Board in pursuit of his economic goals. What emerges is a vivid portrait of an activist president. In evaluating the management of macroeconomic policy in the Johnson administration, the authors focus on how presidential policies are developed and adopted rather than on the substance of the policies themselves. They conclude that the Johnson administration competently managed policy development during its presidential years. This book is a volume in the Administrative History of the Johnson Presidency Series sponsored by the LBJ School of Public Affairs at the University of Texas at Austin, the first two volumes of which were published by the University of Chicago Press. Managing Macroeconomic Policy: The Johnson Presidency was funded in part by the National Endowment for the Humanities.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://onlinelibrary.wiley.com/doi/10.1111/j.1538-4632.1975.tb01030.x\">A Hierarchical Goal‐Programming Approach To Environmental Land Use Management</a></p>\n<blockquote>\n<p>A mathematical goal programming model is described for the purpose of normative policy evaluation of environmental land use management on the Texas Gulf Coast. The model's three‐level hierarchy, linking statewide, multicounty, and local models, allows the explicit consideration of competing goals (policies) at different spatial scales. Micro-level impacts of macro-level environmental policy decisions, and vice versa, can be assessed.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.amazon.co.uk/finance-prospects-policies-Bahrain-1975-1985/dp/B0007AJRFC\">Public Finance Policies for Bahrain</a></p>\n</li>\n<li><p><a href=\"https://link.springer.com/article/10.1007/BF02686450\">Gold rush economics: Development planning in the Persian/Arabian Gulf</a></p>\n<blockquote>\n<p>The events of 1973 in the Middle East, which culminated in a nearly four-fold increase in the posted price of oil, have generated a good deal of concern about the need for recycling of oil revenues. Most of the discussion to date has focused on the problem from the standpoint of oil-importing countries. Comparatively little attention has been given to problems facing the major oil-exporting countries. This paper examines planning problems in the context of sudden affluence. It centers on the implications for development planning of the gold rush phenomenon which characterizes the oil-exporting countries of the Middle East in general, and the desert economies of the Persian/ Arabian Gulf in particular.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://heinonline.org/HOL/LandingPage?handle=hein.journals/udetmr48&amp;div=30&amp;id=&amp;page=\">Public Policy for Controlling the Environment</a></p>\n<blockquote>\n<p>No single issue has so captivated public attention in recent months as concern over the deterioration of the environment. Problems of environmental pollution, land use planning, population control, and resource sufficiency have come to dominate the public forums of the nation. Awareness of these problems has created increased demands for the development of public policies for controlling the environment.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://www.tandfonline.com/doi/abs/10.1080/00263207908700408?journalCode=fmes20\">Land reform in Jordan: the east Ghor canal project</a></p>\n<blockquote>\n<p>An important land reform effort was undertaken in Jordan in 1959 in connection with the development of the East Ghor Canal Project in the Jordan Valley. The historical background and pattern of land reform in Jordan were similar in many respects to that found in other areas in the Middle East. The purpose of this article is to describe the land reform measures and to evaluate their impact on land redistribution and tenure and on agricultural output and living standards in the project area.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://eric.ed.gov/?id=ED354629\">Cost Effectiveness of Alternative Year Schooling. Final Report</a></p>\n<blockquote>\n<p>This study describes the major forms of year-round education, evaluates their potential costs and educational benefits (including effects on student academic achievement, learning retention, socialization, and employability), and assesses such programs' feasibility as to legal requirements and effects on school personnel and the larger community. Year-round education (YRE) or year-round schools or schooling (YRS) often connote two different alternations to the traditional school calendar: (1) increasing classroom time by extending the school year or the school day, and (2) rearranging the traditional 180-day school calendar to provide more frequent and shorter vacation periods. Research indicates that substantial increases in classroom time would result in some improvements in academic achievement but would be very costly. Single-track YRE programs (all students in school or on vacation at the same time) now account for 46 percent of all YRE programs. The normal 3-month summer break may hinder learning retention, particularly for disadvantaged youth. Multitrack YRE programs offer potential capital savings due to more efficient facilities use; single-track YRE programs can be more expensive than 9-month calendar schools. A telephone survey of 1,003 Texans indicates weak commitment to YRE, but favorable disposition toward trying it. Another informal survey showed that 41 Texas school districts were operating some form of YRE (mostly single-track programs) and that teacher response is positive. Recommendations for further implementation of year-round programs in Texas are provided.</p>\n</blockquote>\n</li>\n<li><p><a href=\"https://eric.ed.gov/?id=EJ516036\">Year-Round Schools: A Matter of Time? Cost-Saving Opportunities and Pitfalls</a></p>\n<blockquote>\n<p>While there appears to be widespread agreement that schools need to use time more effectively to improve learning opportunities, education research is needed on the cost and results of using time differently. Presents a cost-simulation model to determine the relative costs of a year-round program. (MLF)</p>\n</blockquote>\n</li>\n<li><p>Public Policy toward Bank Mergers: A Legal and economic evaluation</p>\n<blockquote>\n<p>Public Policy toward the banking industry has undergone significant changes since 1960. Guided by two acts of Congress and a number of court cases, a new public policy toward bank mergers has emerged. In contrast to over a century of regulatory policy designed, at least in part, to restrict competition in banking, the new merger policy seeks to promote competition among banks.</p>\n</blockquote>\n</li>\n<li><p>Contributor articles to professional journals, chapters to books</p>\n</li>\n</ul>\n<p><a href=\"https://texashistory.unt.edu/ark:/67531/metapth864096/\">Interview with Dr. Jared Hazleton, April 2, 1986</a> on <a href=\"https://texashistory.unt.edu/\">The Portal to Texas History</a></p>\n",
        "parent": "Page",
        "parent_page": 1,
        "parent_title": "TexEcon",
        "title": "Jared Hazleton",
        "url": "/texecon/jared-hazleton",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "kansas",
        "controller": "Page",
        "description": "Kansas",
        "keywords": " ",
        "display_navigation": true,
        "order": 200,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-right",
        "id": 23,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"kansas\">Kansas</h1>\n<p><strong>The Sunflower State</strong></p>\n<p>Located in the heartland of the United States, Kansas has a diverse economy that is driven by agriculture, manufacturing, and the energy sector. With a population of over 2.9 million people, Kansas is the 35th most populous state in the country. It boasts a low cost of living, high quality of life, and a pro-business environment that make it an attractive destination for entrepreneurs and investors.</p>\n<p>One of the biggest strengths of the Kansas economy is its agricultural sector. The state is a major producer of wheat, corn, soybeans, and cattle, and has a robust infrastructure in place to support these industries. Kansas is also home to a number of world-class research institutions, including Kansas State University and the University of Kansas, which are actively engaged in developing new technologies and methods to improve agricultural production.</p>\n<p>In addition to agriculture, Kansas has a strong manufacturing base. The state is home to a number of major manufacturing companies, including Spirit AeroSystems, Textron Aviation, and Garmin International, among others. These companies have access to a highly skilled workforce and a supportive business environment, making Kansas an ideal location for manufacturing operations.</p>\n<p>Another key sector of the Kansas economy is energy. The state is a major producer of oil, natural gas, and wind energy, and has made significant investments in renewable energy infrastructure in recent years. With its abundant natural resources and favorable regulatory environment, Kansas is poised to continue growing its energy sector in the coming years.</p>\n<p>Overall, Kansas offers a wealth of economic development opportunities for businesses and investors. Its diverse economy, pro-business environment, and skilled workforce make it an attractive destination for a range of industries. Whether you are looking to start a new business, expand your operations, or invest in the future, Kansas is a state worth considering.</p>\n<p><br/>   <img src=\"https://upload.wikimedia.org/wikipedia/commons/a/a6/Kansas_in_United_States.svg\" alt=\"Kansas\" /></p>\n<p>Kansas's strategic geographical position in the center of the United States serves as a logistical hub, enhancing its appeal for businesses involved in transportation and distribution. The state's extensive network of highways and railways facilitates efficient cross-country freight movement, positioning Kansas as a crucial node in the national supply chain. This logistical advantage supports a wide range of industries, from agriculture to manufacturing, ensuring products made or grown in Kansas reach markets quickly and efficiently.</p>\n<p>Beyond its economic contributions, Kansas is steeped in rich cultural heritage and history. It played a pivotal role in the American Civil War, earning the nickname &quot;Bleeding Kansas&quot; due to the violent confrontations between pro-slavery and anti-slavery factions. Today, this history is commemorated in museums and historic sites across the state, offering educational opportunities and fostering a deeper understanding of the nation's past. These cultural assets not only enhance the state's quality of life but also attract tourists, contributing to the local economy.</p>\n<p>Kansas's commitment to education is evident in its strong public school system and array of higher education institutions. Beyond Kansas State University and the University of Kansas, the state is home to numerous colleges and universities that contribute to a well-educated workforce. This emphasis on education fuels innovation and attracts businesses in high-tech and research-driven industries, further diversifying the state's economic base.</p>\n<p>The state's natural beauty and outdoor recreational opportunities are another facet of its appeal. From the rolling Flint Hills to the vast prairies, Kansas offers a serene and picturesque landscape ideal for outdoor enthusiasts. State parks, wildlife refuges, and recreational trails provide residents and visitors alike with ample opportunities for hiking, biking, fishing, and bird watching, contributing to the state's quality of life and tourism.</p>\n<p>Kansas also stands out for its vibrant agricultural festivals and events, which celebrate the state's farming heritage and community spirit. These events, such as the Kansas State Fair, offer a glimpse into the agricultural practices and traditions that have shaped the state, fostering a sense of community and belonging among residents and visitors.</p>\n<p>The state's commitment to innovation extends into the realm of sustainable farming and renewable energy. Kansas's investments in wind energy, in particular, have made it a leader in renewable energy production. The state's wind farms not only contribute to a cleaner environment but also provide economic benefits through job creation and additional income for landowners.</p>\n<p>In the realm of health care, Kansas is making strides to ensure that both urban and rural residents have access to quality services. The state's health care system includes cutting-edge medical centers and a network of rural health facilities, working together to improve health outcomes and accessibility for all Kansans.</p>\n<p>Community development initiatives in Kansas are aimed at enhancing the livability of both urban and rural areas. Programs focused on downtown revitalization, affordable housing, and public amenities are strengthening communities across the state, making Kansas an even more attractive place to live and work.</p>\n<p>Kansas's philanthropic spirit, embodied by numerous charitable organizations and community groups, plays a crucial role in addressing social issues and improving the welfare of its residents. These efforts reflect the state's commitment to fostering a supportive and inclusive community.</p>\n<p>Lastly, Kansas's spirit of innovation and resilience shines through its thriving entrepreneurial ecosystem. The state offers a supportive environment for startups and small businesses, with resources, networks, and funding opportunities designed to encourage innovation and growth. This entrepreneurial spirit is a testament to Kansas's forward-looking attitude and its unwavering commitment to building a prosperous future for all its residents.</p>\n<p>Together, these elements paint a picture of a state that is not only a key player in the national economy but also a vibrant, diverse, and welcoming community. With its blend of economic strength, cultural richness, and community-driven initiatives, Kansas continues to be a place where history, innovation, and community spirit intersect, offering a unique and fulfilling quality of life.</p>\n",
        "parent": "",
        "parent_page": null,
        "parent_title": "",
        "title": "Kansas",
        "url": "/kansas",
        "virtual_path": "index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas/keller",
        "controller": "Page",
        "description": "Keller",
        "keywords": " ",
        "display_navigation": true,
        "order": 180,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 9,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"keller-texas\">Keller, Texas</h1>\n<p><strong>Big-City Convenience with Small-Town Charm</strong></p>\n <iframe width='560' height='315' src='https://www.youtube.com/embed/db45f7ESwxc' frameborder='0' allowfullscreen=''></iframe>\n<p>Located in the heart of the Dallas-Fort Worth Metroplex, Keller, Texas is a city that offers the best of both worlds. On one hand, it provides the conveniences and amenities of a big city while on the other, it boasts a small-town feel with an emphasis on quality of life. The city is home to approximately 46,000 residents who live within its 18.4 square miles.</p>\n<p>One of the reasons for Keller's popularity is its excellent school system, which has helped make it one of the best places to raise a family in Texas. In addition, the city has a thriving economy, with two distinct business districts, Old Town Keller and the urban Keller Town Center, which offer residents a wide range of shopping and dining options.</p>\n<p>The city is also a great place for outdoor enthusiasts. The citywide parks and trails system, anchored by Big Bear Creek, provides plenty of opportunities for recreation, and the Keller Pointe, the city’s recreation and aquatics center, is a great place to stay active and healthy. For those who prefer indoor activities, the Keller Public Library offers a large collection of books and online resources, while the new Keller Senior Activities Center provides seniors with a place to come together for socialization and stimulating activities.</p>\n<p>In recent years, Keller has been recognized as one of the &quot;Best Small Cities in America,&quot; one of the &quot;Top 10 Places to Live in Texas,&quot; and one of the &quot;Best Places to Raise a Family in Texas.&quot; With a low crime rate, thanks to its accredited police and fire departments, Keller is also consistently named one of the safest cities in the country.</p>\n<p>In conclusion, if you're looking for a city that offers a high quality of life, a strong sense of community, and plenty of opportunities for recreation and entertainment, Keller is definitely worth considering. With its proximity to both Fort Worth and Dallas and the DFW Airport, it's the perfect place to call home.</p>\n",
        "parent": "Page",
        "parent_page": 2,
        "parent_title": "Texas",
        "title": "Keller",
        "url": "/texas/keller",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texecon/mark-hazleton",
        "controller": "Page",
        "description": "Solutions Architect",
        "keywords": " ",
        "display_navigation": true,
        "order": 100,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-right",
        "id": 3,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"mark-hazleton-solutions-architect\">Mark Hazleton - Solutions Architect</h1>\n<p><img src=\"https://markhazleton.com/assets/img/MarkHazleton.jpg\" alt=\"Mark Hazleton\" /></p>\n<p>Mark Hazleton is a co-founder of Control Origins, a leading provider of technology solutions for economic analysis. He is a seasoned entrepreneur with a passion for technology and economics, and his expertise is a valuable asset to TexEcon.com.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Y530WAkFJGY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>With his background in both technology and economics, Mark brings a unique perspective to the world of economic analysis. He is committed to using technology to help people understand the complexities of the economy and to make the analysis of economic data more accessible and understandable.</p>\n<p>At Control Origins, Mark has helped to develop cutting-edge solutions for the analysis of economic data and has been recognized as a leader in the field. His insights and expertise are widely respected, and he is a sought-after speaker at conferences and events.</p>\n<p>In addition to his work at Control Origins, Mark is also a regular contributor to TexEcon.com, where he provides technical insights and commentary on the use of technology in economic analysis. His expertise and insights are an important addition to our platform, and we are proud to have him as a member of our team.</p>\n<p>Join us in welcoming Mark Hazleton to TexEcon.com, and be sure to check out his contributions to our platform. With his combination of technology and economic expertise, Mark is sure to provide valuable insights and perspectives on the Texas economy.</p>\n<h2 id=\"professional-overview\">Professional Overview</h2>\n<p>Mark Hazleton is a <strong>Solutions Architect</strong> with extensive experience in creating web solutions that align with business goals. With a career spanning over two decades, Mark has a solid track record of delivering practical and effective technology solutions for a variety of clients.</p>\n<h2 id=\"key-highlights\">Key Highlights</h2>\n<ul>\n<li><p><strong>Senior Software Developer at Baylor Scott &amp; White (August 2020 - Current)</strong></p>\n<ul>\n<li>Migrated a legacy API from ASP.NET to ASP.NET Core, enhancing scalability and maintainability.</li>\n<li>Developed internal wikis for API delivery consistency and improved team onboarding.</li>\n<li>Conducted code reviews and mentored junior developers, enhancing code quality and team productivity.</li>\n</ul>\n</li>\n<li><p><strong>Solutions Architect / Consultant at Control Origins (April 2006 - Current)</strong></p>\n<ul>\n<li>Delivered technology solutions aligned with regulatory requirements and business strategies.</li>\n<li>Focused on enabling technology to drive business success.</li>\n<li><a href=\"https://controlorigins.com\">Control Origins Website</a></li>\n</ul>\n</li>\n<li><p><strong>Digital Solutions Architect at CEC Entertainment (November 2015 - June 2020)</strong></p>\n<ul>\n<li>Designed and implemented custom software solutions using Scrum methodologies.</li>\n<li>Collaborated with business leaders to deliver software solutions that added value to the business.</li>\n</ul>\n</li>\n<li><p><strong>VP of Delivery Management at Advice Interactive Group (December 2013 - July 2014)</strong></p>\n<ul>\n<li>Focused on improving digital visibility through search, social design, and development.</li>\n</ul>\n</li>\n</ul>\n<h2 id=\"notable-projects\">Notable Projects</h2>\n<ul>\n<li><p><strong>Prompt Spark</strong></p>\n<ul>\n<li>A tool for managing, tracking, and comparing system prompts to optimize the use of large language models (LLMs).</li>\n<li><a href=\"https://promptspark.markhazleton.com/\">PromptSpark</a></li>\n</ul>\n</li>\n<li><p><strong>Mechanics of Motherhood</strong></p>\n<ul>\n<li>A blog for sharing recipes, thoughts, and experiences, using a custom CMS built in .NET 8.</li>\n<li><a href=\"https://mechanicsofmotherhood.com/\">Mechanics of Motherhood</a></li>\n</ul>\n</li>\n<li><p><strong>Net 8 Sample MVC CRUD</strong></p>\n<ul>\n<li>A project for exploring new approaches and technologies in ASP.NET.</li>\n<li><a href=\"https://samplecrud.markhazleton.com/\">Net 8 Sample MVC CRUD</a></li>\n</ul>\n</li>\n</ul>\n<h2 id=\"published-articles\">Published Articles</h2>\n<p>Mark writes about practical solutions and focuses on the essentials in his articles:</p>\n<ul>\n<li><strong>Sidetracked by Sizzle</strong>: Discusses the importance of avoiding distractions by flashy features that do not add significant business value.</li>\n<li><strong>Transforming SampleMvcCRUD with .NET Aspire</strong>: Highlights improvements in observability and performance in .NET projects.</li>\n<li><strong>Taking Microsoft Copilot Studio for a Test Drive</strong>: Explores AI-powered assistant capabilities.</li>\n</ul>\n<h2 id=\"skills-expertise\">Skills &amp; Expertise</h2>\n<ul>\n<li><strong>Languages &amp; Tools</strong>: C#, .NET, Azure, Docker, AWS, Git, GitHub, Markdown, Bootstrap, Gulp, NPM, NuGet.</li>\n<li><strong>Roles and Processes</strong>: Cloud Solution Architect, DevOps CI/CD, Cross-Functional Teams, Agile Development &amp; Scrum.</li>\n</ul>\n<h2 id=\"educational-background\">Educational Background</h2>\n<ul>\n<li><strong>University of North Texas</strong>: Bachelor of Arts in General Studies - Business, Communications, Radio TV &amp; Film.</li>\n<li><strong>Systems Engineer Development (SED) Program</strong>: Electronic Data Systems (EDS).</li>\n</ul>\n<h2 id=\"personal-interests\">Personal Interests</h2>\n<ul>\n<li><strong>Travel and Outdoor Exploration</strong>: Enjoys discovering new destinations and hidden gems.</li>\n<li><strong>Hiking and City Exploration</strong>: Embraces the joy of exploring diverse cultures and landscapes.</li>\n<li><strong>Culinary Adventures</strong>: Enthusiastic about outdoor cooking, especially smoking and grilling.</li>\n</ul>\n<h2 id=\"connect-with-mark\">Connect with Mark</h2>\n<ul>\n<li><a href=\"https://www.linkedin.com/in/markhazleton\">LinkedIn</a></li>\n<li><a href=\"https://github.com/markhazleton\">GitHub</a></li>\n<li><a href=\"https://www.youtube.com/@MarkHazleton\">YouTube</a></li>\n<li><a href=\"https://www.instagram.com/markhazleton/\">Instagram</a></li>\n</ul>\n<p>Mark Hazleton focuses on delivering practical and effective technology solutions that align with business needs.</p>\n",
        "parent": "Page",
        "parent_page": 1,
        "parent_title": "TexEcon",
        "title": "Mark Hazleton",
        "url": "/texecon/mark-hazleton",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "arizona/phoenix",
        "controller": "Page",
        "description": "Phoenix, Arizona: A Growing Hub of Economic Activity",
        "keywords": " ",
        "display_navigation": true,
        "order": 220,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-right",
        "id": 26,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"phoenix-arizona\">Phoenix, Arizona</h1>\n<h2 id=\"a-growing-hub-of-economic-activity\">A Growing Hub of Economic Activity</h2>\n<p>Phoenix, Arizona is the fifth-largest city in the United States, and the capital of the state of Arizona. Known for its sunny climate, vibrant cultural scene, and stunning desert landscape, Phoenix is also a hub of economic activity in the southwestern United States. With a diverse economy, talented workforce, and supportive business climate, Phoenix is a great place to do business.</p>\n<p>Industries Driving Economic Growth in Phoenix</p>\n<p>Phoenix is home to a wide range of industries that are driving economic growth in the region. Here are a few of the key sectors:</p>\n<p>Advanced Manufacturing: Phoenix is a hub of advanced manufacturing, with industries like aerospace, defense, and electronics playing a significant role in the local economy. Companies like Honeywell, Raytheon, and Boeing have a significant presence in the region, and the area is also home to a growing number of startups and small businesses in the manufacturing sector.</p>\n<p>Healthcare: Healthcare is a critical sector in Phoenix, with major healthcare providers like Banner Health, Dignity Health, and Phoenix Children's Hospital operating in the region. The area is also home to several research institutions and biotech companies, contributing to the growth of the life sciences sector.</p>\n<p>Technology: Phoenix is becoming an increasingly important hub for technology, with companies like Intel, Microsoft, and Amazon establishing major operations in the region. The area is also home to a growing number of startups and entrepreneurship organizations, contributing to the growth of the tech sector.</p>\n<p>Tourism: Phoenix is a popular tourist destination, with attractions like the Grand Canyon, Sedona, and the Phoenix metropolitan area drawing millions of visitors each year. In addition to traditional tourism, Phoenix has also seen significant growth in the hospitality industry, with new hotels and resorts opening throughout the region.</p>\n<p>Support for Business and Economic Development</p>\n<p>Phoenix offers a supportive business climate for companies of all sizes. The Greater Phoenix Economic Council (GPEC) is a nonprofit organization that works to attract and retain businesses in the region, offering a range of services and resources to help companies grow and succeed. The City of Phoenix Economic Development Department also provides a range of resources and support for businesses looking to locate or expand in the area.</p>\n<p>In addition to support from economic development organizations, Phoenix offers a range of incentives and tax breaks to businesses. The Arizona Commerce Authority offers a variety of programs to help businesses grow and succeed in the state, including tax credits, workforce training grants, and research and development funding.</p>\n<p>Conclusion</p>\n<p>Phoenix, Arizona is a thriving hub of economic activity, driven by a diverse range of industries and a supportive business climate. With a talented workforce, top-notch research institutions, and a growing tech sector, Phoenix is well positioned for continued economic growth and development in the years to come.</p>\n",
        "parent": "Page",
        "parent_page": 25,
        "parent_title": "Arizona",
        "title": "Phoenix",
        "url": "/arizona/phoenix",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas/roanoke",
        "controller": "Page",
        "description": "Roanoke",
        "keywords": " ",
        "display_navigation": true,
        "order": 190,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 10,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"roanoke-texas\">Roanoke, Texas</h1>\n<p><strong>Where Small-Town Charm Meets Big-City Amenities</strong></p>\n<p>Welcome to Roanoke, Texas – a unique blend of small-town charm and big-city amenities in the heart of the Dallas-Fort Worth Metroplex. With a population of approximately 7,000, Roanoke is the perfect blend of friendly community and modern amenities.</p>\n<p>Roanoke is a city with a strong commitment to preserving its history and promoting its future. The downtown area is home to a number of historical landmarks and is also the hub of the city’s business district, with a wide range of shopping and dining options available. The city is well-known for its quality of life, and residents take pride in its safe neighborhoods, highly-regarded schools, and numerous parks and recreation facilities.</p>\n<p>In addition to its charming downtown area, Roanoke is also located within a short drive of the DFW International Airport, making it a convenient location for both businesses and residents. The city has also attracted a number of large employers, including General Electric and JPS Health Network, which have contributed to the city’s growing economy.</p>\n<p>The city of Roanoke also values its cultural diversity and is home to a number of ethnic festivals and events, including the annual Oktoberfest, which celebrates the city’s German heritage.</p>\n<p>In summary, Roanoke, Texas is a city with a unique combination of small-town charm and big-city amenities. With a focus on quality of life, economic growth, and cultural diversity, Roanoke is a vibrant and thriving community that is proud of its past and excited about its future.</p>\n",
        "parent": "Page",
        "parent_page": 2,
        "parent_title": "Texas",
        "title": "Roanoke",
        "url": "/texas/roanoke",
        "virtual_path": "index/index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texas",
        "controller": "Page",
        "description": "Texas",
        "keywords": " ",
        "display_navigation": true,
        "order": 140,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-heart",
        "id": 2,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"texas\">Texas</h1>\n<p><strong>The Lone Star State</strong>\nTexas is the second largest state in the United States by both land area and population, and it is widely recognized as one of the strongest and most diverse economies in the country. With its rich natural resources, highly skilled workforce, and supportive business climate, Texas is a hub for economic activity and a major contributor to the overall strength of the U.S. economy.</p>\n<p>One of the key strengths of the Texas economy is its diversification. The state has a thriving energy sector, a large and growing technology industry, a thriving manufacturing sector, and a strong service sector. This diversification means that the Texas economy is less susceptible to economic shocks than economies that are heavily reliant on a single industry.</p>\n<p>Another strength of the Texas economy is its low cost of living. Texas is one of the most affordable states in the country, with a cost of living that is significantly lower than many other states. This affordability is a major attraction for businesses and individuals, and it is a key factor in the state's ability to attract new residents and businesses.</p>\n<p>Despite its strengths, the Texas economy is not immune to challenges and risks. For example, the state is susceptible to natural disasters, such as hurricanes and droughts, which can disrupt economic activity and cause significant damage. Additionally, the state's fast-growing population is putting pressure on infrastructure and other public services, and this is a challenge that will need to be addressed in the years to come.</p>\n<p>Despite these challenges, the outlook for the Texas economy remains positive. With its diverse and growing economy, low cost of living, and supportive business climate, Texas is well positioned to continue its economic growth and to maintain its status as one of the strongest and most dynamic economies in the country.</p>\n<p>At TexEcon.com, our mission is to provide insightful analysis and commentary on the Texas economy. We believe that by providing expert analysis and commentary, we can help our audience make informed decisions and stay ahead of the curve in a rapidly changing economy. Join us as we explore the strengths, challenges, and future prospects of the Texas economy.</p>\n<p><br/>   <img src=\"https://upload.wikimedia.org/wikipedia/commons/a/ad/Texas_in_United_States.svg\" alt=\"Texas\" /></p>\n",
        "parent": "",
        "parent_page": null,
        "parent_title": "",
        "title": "Texas",
        "url": "/texas",
        "virtual_path": "index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "texecon",
        "controller": "Page",
        "description": "TexEcon",
        "keywords": " ",
        "display_navigation": true,
        "order": 30,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-home",
        "id": 1,
        "isHomePage": true,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<p>TexEcon.com is a platform dedicated to providing insightful analysis and commentary on the Texas economy. Our mission is to educate and inform our audience about the current state and future prospects of the Texas economy, and to provide a platform for discussion and exchange of ideas.</p>\n<p>We are a team of experts in the field of economics, led by Dr. Jared Hazleton, a renowned economist with years of experience in economic analysis and commentary. In addition to Dr. Hazleton's expertise, we also feature technical insights from Mark Hazleton, co-founder of Control Origins, a leading provider of technology solutions for the economic analysis.</p>\n<p>Our content is designed to appeal to a wide range of audiences, including investors, business owners, policymakers, students and academics, and anyone interested in the economy of Texas. We believe that by providing high-quality, expert analysis, we can help our audience make informed decisions and stay ahead of the curve in a rapidly changing economy.</p>\n<p>We believe that a strong and thriving Texas economy benefits everyone, and we are dedicated to promoting economic growth and prosperity in the state. Whether you are a seasoned professional or just starting to explore the world of economics, TexEcon.com is the perfect resource for you.</p>\n<p>Join us on our mission to understand and promote the Texas economy. Explore our site and discover the latest insights, analysis, and commentary on the Texas economy. We look forward to hearing from you!</p>\n",
        "parent": "",
        "parent_page": null,
        "parent_title": "",
        "title": "TexEcon",
        "url": "/",
        "virtual_path": "index"
      },
      {
        "action": "index",
        "api_url": null,
        "argument": "kansas/wichita",
        "controller": "Page",
        "description": "Wichita Kansas",
        "keywords": " ",
        "display_navigation": true,
        "order": 10,
        "domain_id": 1,
        "domain_name": null,
        "domain_url": null,
        "icon": "fa-chevron-left",
        "id": 24,
        "isHomePage": false,
        "modified": null,
        "modified_w3c": "2025-10-23T01:06:56Z",
        "content": "<h1 id=\"wichita-kansas\">Wichita, Kansas</h1>\n<p><strong>Air Capital of the World</strong></p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/UWyKksfIcGQ\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Located in south-central Kansas, Wichita is the largest city in the state with a population of over 389,000 people.</p>\n<p>Wichita, affectionately known as the &quot;Air Capital of the World,&quot; has a rich heritage in aviation that continues to soar to new heights. The city has a long and proud history of aviation, dating back to the early 1900s when companies like Cessna, Beechcraft, and Stearman Aircraft began operating in the area.  The city's skies are filled with the legacy and future of flight.   Today, Wichita is home to a thriving aerospace industry, with over 35,000 people employed in the sector.</p>\n<p>Wichita's aerospace industry is diverse and includes everything from aircraft manufacturing and engineering to maintenance, repair, and overhaul (MRO) services. The city is home to some of the world's leading aviation companies, including Textron Aviation, Spirit AeroSystems, and Bombardier Aerospace. These companies have helped establish Wichita as a global leader in the aerospace industry, with products and services that are used by airlines and governments around the world.</p>\n<p>But Wichita's wings span beyond aviation; it's a community where creativity and innovation thrive in the arts, cuisine, and entrepreneurship.  In addition to aerospace, Wichita has a thriving advanced manufacturing sector that includes everything from automotive parts and machinery to medical devices and electronics. The city is home to a number of innovative companies, including Koch Industries, which is one of the largest privately held companies in the world. Wichita's advanced manufacturing industry benefits from a highly skilled workforce and a supportive business environment that encourages innovation and growth.</p>\n<p>Another key sector of the Wichita economy is healthcare. The city is home to several world-class hospitals and medical centers, including Wesley Medical Center and Via Christi Health. These institutions provide a range of services, including advanced surgery, cancer treatment, and cardiovascular care, among others.</p>\n<p>Wichita offers a wealth of economic opportunities for businesses and investors. Its diverse economy, highly skilled workforce, and supportive business environment make it an attractive destination for a range of industries. Whether you are looking to start a new business, expand your operations, or invest in the future, Wichita is a city worth considering.</p>\n<p>Nestled along the Arkansas River, the city's picturesque waterfront is the backdrop to the iconic Keeper of the Plains statue, a symbol of unity and strength. This stunning piece, standing tall at the confluence of the Big and Little Arkansas rivers, represents the deep-rooted connection Wichita has with the Native American heritage and the natural beauty of the Kansas landscape.</p>\n<p>As the largest city in Kansas, Wichita doesn't shy away from its responsibility as a cultural hub. The Wichita Art Museum and the Ulrich Museum of Art offer windows into worlds of artistic expression, while the Music Theatre Wichita stages bring Broadway's sparkle to the heartland. These institutions, along with vibrant local music and food scenes, make the city a mosaic of cultural experiences.</p>\n<p>Sports enthusiasts find their calling in Wichita as well. Whether it's cheering for the Wichita State Shockers, especially during the excitement of college basketball season, or supporting the Wichita Thunder hockey team, the city's community spirit is palpable in arenas and stadiums across town.</p>\n<p>Education and innovation walk hand in hand in Wichita, with institutions like Wichita State University leading the way in research and development, particularly in aerospace and engineering. This synergy between academia and industry propels the city into new frontiers of knowledge and technology.</p>\n<p>For those with a taste for the outdoors, Wichita's parks and green spaces offer a serene escape from the urban hustle. From the expansive Sedgwick County Park to the meticulously manicured gardens of Botanica, Wichita embraces nature's tranquility and beauty.</p>\n<p>Family-friendly attractions like the Sedgwick County Zoo, Exploration Place, and the Old Cowtown Museum provide interactive learning experiences that bring history and science to life. These spaces not only educate but also entertain, making Wichita a wonderful place for family adventures.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/SHEDn8H9rII?si=PsTsi-Ohu25bpEV9\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>The spirit of entrepreneurship thrives in Wichita's business landscape, where local startups and established businesses alike contribute to a dynamic and growing economy. The Greater Wichita Partnership plays a pivotal role in fostering this environment, driving investment, and supporting innovation.</p>\n<p>Wichita's culinary scene is a melting pot of flavors, with a rich tapestry of food offerings that span from traditional Kansas BBQ to global cuisines. Local farmers' markets and farm-to-table restaurants underscore the city's commitment to fresh, locally sourced ingredients.</p>\n<p>At the heart of it all, Wichita's greatest asset is its people. A community characterized by friendliness, resilience, and a can-do spirit, Wichitans embody the values of kindness, collaboration, and pride in their city. It's this spirit that makes Wichita not just a place to live, but a place to call home.</p>\n<p>Wichita's entrepreneurial spirit is bolstered by a vibrant ecosystem that supports startups and innovation. The city is home to several incubators and accelerators, such as the e2e Accelerator, which provide resources and mentorship to early-stage companies. This nurturing environment encourages risk-taking and fosters a culture of innovation, vital for the economy's continuous growth and diversification.</p>\n<p>The city also takes pride in its commitment to sustainability and green initiatives. Projects like the Wichita Sustainability Integration Plan aim to enhance environmental stewardship while promoting economic development and social equity. Wichita's green efforts are evident in its renewable energy projects, water conservation measures, and sustainable urban planning, making it a leader in eco-friendly practices in the region.</p>\n<p>Wichita's rich history is woven into the fabric of the city, with landmarks such as the Wichita-Sedgwick County Historical Museum and the Kansas Aviation Museum preserving its storied past. These institutions, along with annual events like the Wichita River Festival, celebrate the city's heritage, connecting residents and visitors with Wichita's diverse cultural roots.</p>\n<p>The city's commitment to community health and well-being is evident in its extensive network of walking and biking trails, such as the Arkansas River Path, which provide accessible options for recreation and exercise. Additionally, initiatives like the Wichita Bike Share program demonstrate the city's dedication to promoting active lifestyles and alternative transportation.</p>\n<p>Wichita's thriving arts scene is further enriched by grassroots organizations and community-led events that showcase local talent and creativity. Events like Final Friday, a monthly art crawl, and the Tallgrass Film Festival, an annual celebration of independent cinema, highlight the city's artistic diversity and vibrant cultural landscape.</p>\n<p>The spirit of community service is strong in Wichita, with numerous organizations and volunteers dedicated to making a positive impact. Programs like the United Way of the Plains and the Wichita Volunteer Center exemplify the city's commitment to helping those in need, fostering a sense of unity and compassion among its residents.</p>\n<p>Wichita's strategic location at the crossroads of major highways and its accessibility via the Dwight D. Eisenhower National Airport make it a convenient hub for business and travel. This connectivity not only facilitates commerce but also attracts visitors, contributing to the local economy and cultural exchange.</p>\n<p>Education is a cornerstone of the Wichita community, with a wide range of public and private schools, as well as vocational and technical institutions, providing quality education from preschool to post-secondary levels. The commitment to education ensures a well-educated workforce, ready to meet the challenges of a rapidly changing world.</p>\n<p>Wichita's government and civic leaders are deeply committed to transparency, public engagement, and fostering a sense of community. Initiatives like neighborhood associations and town hall meetings encourage citizen participation in decision-making, strengthening the democratic fabric of the city.</p>\n<p>In conclusion, Wichita's blend of industry, culture, and community spirit creates a dynamic and welcoming city. Its commitment to innovation, sustainability, and inclusivity makes it not only a great place to do business but also a vibrant community where people from all walks of life can thrive and succeed.</p>\n",
        "parent": "Page",
        "parent_page": 23,
        "parent_title": "Kansas",
        "title": "Wichita",
        "url": "/kansas/wichita",
        "virtual_path": "index/index"
      }
    ],
    "message": null,
    "modifiedDT": "2024-04-18T18:55:05.3978075",
    "modifiedID": 99,
    "name": "TexEcon.com",
    "siteName": "texecon",
    "siteStyle": "texecon",
    "siteTemplate": "ControlSpark",
    "url": "",
    "useBreadCrumbURL": true,
    "versionNo": 1,
    "websiteTitle": "TexEcon.com",
    "websiteUrl": "https://texecon.com",
    "isRecipeSite": false
  },
  "message": "Website retrieved successfully"
}